# -*- coding: utf-8 -*-
"""Story config.
"""
################################################################
#
# Sample:
#
# 1) PERSONS
#       人物簡易設定
# 2) AREAS
#       エリア設定
# 3) STAGES
#       舞台基本設定
# 4) DAYS
#       年月日設定
# 5) TIMES
#       時間帯基本設定
# 6) ITEMS
#       小道具設定
# 7) WORDS
#       辞書設定
# 8) RUBIS
#       ルビ設定
# 9) LAYERS
#       レイヤ設定
#
################################################################


PERSONS = (
        # Tag / 氏,名 / 歳 / 誕生日 / 性別 / 職業 / 呼称 / 紹介
        ("shin", "新太", "杉浦,新太", 18,(1,1), "male", "高校生", "me:俺:k_mami:マミ:k_misae:エリザ"),# 主人公
        ("mami", "真実子", "戸川,真実子", 18,(1,1), "female", "高校生", "me:わたし:k_shin:シンディ"),# マドンナ
        ("yusaku", "遊作", "木土,遊作", 18,(1,1), "male", "高校生", "me:僕"),# 親友
        ("kana", "夏菜", "槇山,夏菜", 18,(1,1), "female", "高校生"),# 彼女の友だち／幼馴染
        ## vr
        ("mist", "ミスト", "", 20,(1,1), "female", "騎士", "me:我"),# 謎の女騎士
        ## school
        ("asako", "朝子", "麦田,朝子", 40,(1,1), "female", "教師", "me:私"),# 最初の担任
        ("misae", "美佐恵", "鏑木,美佐恵", 30,(1,1), "female", "教師", "me:私"),# 臨時の担任教師
        ## monster
        ("goblin", "ゴブリン", "", 99,(1,1), "male", "怪物"),
        ("ork", "オーク", "", 99,(1,1), "male", "怪物"),
        )

AREAS = (
        # Tag / 名前 / x,y / 備考
        )

STAGES = (
        # Tag / 名前 / Area / 紹介
        ("hisroom", "新太の部屋", "Tokyo"),
        ("hishome", "杉浦家", "Tokyo"),
        ("highschool", "高校", "Tokyo"),
        )

DAYS = (
        # Tag / 名前 / 月 / 日 / 年
        ("current", "current", 1,1, 2020),
        )

TIMES = (
        # Tag / 名前 / 時 / 分
        )

ITEMS = (
        # Tag / 名前 / 紹介
        ("kukkorogame", "姫騎士オンライン"),
        )

WORDS = (
        # Tag / 名前 / 紹介
        ("magi", "魔素"),
        )

RUBIS = (
        # Base / Rubi / Exclusion / Type
        ("捕虜", "｜捕虜《ほりょ》"),
        ("虜となり", "｜虜《とりこ》となり"),
        ("魔素", "｜魔素《まそ》"),
        ## name
        ("杉浦新太", "｜杉浦新太《すぎうらしんた》"),
        ("戸川真実子", "｜戸川真実子《とがわまみこ》"),
        ("槇山夏菜", "｜槇山夏菜《まきやまかな》"),
        ("木土遊作", "｜木土遊作《きどゆうさく》"),
        ("鏑木美佐恵", "｜鏑木美佐恵《かぶらぎみさえ》"),
        )

LAYERS = (
        # Key / Title / Words
        )

